{
  "title": "Speaking English: My Way or the Highway",
  "content": "My pronunciation of English words is not good, and I admit it openly not because I am not afraid of weakness, or I wanted to make a statement. It is just that when I admit it gives me mental space to not work on it and finally accept that yes, I am going to pronounce it that way, my way.\n\nBut let me share why my pronunciation is that way. I love self-reflection, or it should be self-research: research on oneself to understand why I behave the way I behave, my habit, my biases, my preference. More on this later, let get back to the topic why my pronunciation is like this. Sorry, it is my old habit of getting distracted or take interest on a similar topic parallel until my thinking become almost perpendicular to what I was thinking earlier.\n\nI was bought up in a very rural area of my country. We had our own dialect for our own native languages, or a different accent for such. To be honest, I am not that precisely aware of what is the difference between accent or dialect, but I believe dialect will serve the best in the context. Often, we use a long and lest tiring pronunciation of the original words in to sound soft and add in butter to the speaker but in a good way. As a result, we tend to use a less tiring pronunciation of the original. At least that is what I think, although there can be a debate on what is less or more tiring pronunciation to tongue and how to measure it. I am from the western part of Nepal, and I feel the pronunciation or the way we speak is easy or more less formal than how it should be spoken. As a result, my cultural legacy (Some words that I just learn from reading the book “Outliers”), I tend to prefer what is easier for my tongue or what is easier to speak to convey the message to the speaker. This learned behavior got transferred to what I now call My way of English or the highway of English.\n\nBoth of my parents are high school graduate from public schools, it is all the almost 20-22 years back in Nepal. Back then, they used to have less English, and more subjects were taught in Nepali, my native language. English for them was never a thing all thanks to Mark Zuckerberg who developed Fb in 2008 I guess and what I feel contributed the expansion of English all over the world. I meant social media in general. They were happy in their small world never learning about US and European countries and never feeling the need to learn English. So, when you are born with a family that had a little to do with English, your English by nature will not be good because nobody in your family speak it or even if speaking English fluently was a big thing in school or society, I had no one in my family to look and learn because learning through examples is one of the way how I learn this or figure out things, and there was no one to guide me. I do not complain about this or my parents. It is just that I was bought up in a less English engaging family.\n\nIt is not that only my English pronunciation is bad. About 7 years ago, I also find it hard to pronounce some of the obscure words of my native language. It is only after my 8th grade; I started paying attention and I learned some ways to speak in my native language. Unlike English, words in Nepali are spoked exactly how they are written, okay for the most words, and that helped me immensely how I speak in my native language. When I was in my 1st or 2nd, my grandfather would tell me to recite me some phrases from a newspaper or marriage invitation card. I still remember the card was for Krishna Sharma, my neighbors and I could not read it back then and I told him that the school has not taught me to pronounce such obscure. My grandfather mocked me that I should know how to pronounce such words even if the school did not teach it to me. I was a bright student, and I feel it as my weakness not able to pronounce such words. So, for most of the time, I started avoiding what was difficult for me just me myself secure until grade 8 when I felt like I will get exposed and I started liking to learn the pronunciations of native language all thank to it that it is pronounce exactly how it is written, okay for most of the words.\n\nComments from my grandfather had a profound effect on my pronunciations. Like I said I always tried to avoid those words that were difficult to me both for my native language and English. Unlike Nepali, English words are pronounced differently than how there are written. That too added an extra layer of difficulty to my learning. So, either I avoid it or I started pronouncing how it appeals to me because I never learned to speak or pronounce it nor there were easy as my Native language.\n\nMy house was a little bit far from my school and I never had someone of my age living near me or someone who had their friends speak English. I feel that also had some effects in my learning. While my friends (friends that I have in my school) would talk about some Hollywood movies they watched in TV, all thanks to my poor cable connection I never got a chance to explore those channels, Because of having no friends that were exposed to English that could come to my house and give some exposure or no English channels gave me less exposure to English over my childhood. As a result, I heard very less English words than my friend and hence my pronunciations became my way or the highway rule. I feel a bigger portion of learning to pronounce English is through exposure. Either I was afraid for that, or I never got a chance to get one.\n\nNot being a native speaker English also add misery to my pronunciation skills when I often find myself translating everything in my native language to understand it first, with word too. So I follow a similar rule how I pronounce Nepali words to English words and for obvious reason that does not go well ending in my way or high way.\n\nAs I become more aware of these facts, I feel my pronunciations is relatively better or it is better to say I am more confident because my pronunciations is still not that good. When I fluent, I do not feel or do not think much about pronunciation. Lately I figured it out how my confidence level has effects on my pronunciations and that too has helped me gets better in conveying message. Coming to US and meeting new people has helped tremendously as I am having more exposure. Seeing people from different background and observing their struggle for English has helped me acknowledge my weakness better, and As I do more self-research and get more exposure I am sure I will find a way out of my way or the highway.",
  "author": "Ashok Paudel"
}
