{
  "title": "It Would Just Be Better",
  "author": "Ashok Paudel",
  "content": "It was 12:19 AM, and I told myself that I must write to say to the world that it is beautiful, as it has its own way of everything happening. I am so occupied, and you are so occupied, to sit here and realize that it is not going anywhere. The happiness to sit and gaze at the beauty of the world—oh my Lord, what have you created.\n\nYou created me with a body, with a very beautiful mind, and gave me an imagination. For years, I was searching for others to see what I see in you, and what I see through you.\n\nOf course, you are merely a bundle of atoms, with 99% of your space empty. And the emptiness, my friend, is where all the beautiful things lie.\n\nFor what I say, for what the world says, may seem delusional. But I must say—it is not. You lie beyond what you are, what you do, what you will be.\n\nOh, my friend, the world will say whatever it likes, whatever fits in its eyes. I’m sorry, my friend, that I’m a part of this world too. But there is more beyond that. You should be perceived. You should be understood.\n\nImagine how you were born, how you learned about the world, and how you will make a life out of that emptiness.\n\nThose eyes that see beauty. Those sensations.\n\nFor once, calm down and look inside.\n\nWhat lies there is beyond your own understanding.\n\nSit there, where things cannot be understood by anyone.\n\nIt can only be appreciated in calmness.\n\nFor once, my friend, I must say: you are beautiful with what you have inside—a driving power that is beautiful. If it was not about the world, if there was no hurry to achieve everything, if there was no blindness among us, you would have sat down, not worrying about others. You would have sat down and observed that there is something beautiful running down your spine.\n\nAll you did was run a race.\n\nYou were put in a race, and you were told to run as fast as you can.\n\nThere’s nothing wrong with that.\n\nBut you did not learn the flow.\n\nYou started looking at others, noticing how they were running.\n\nAnd you just kept running.\n\nThere was another way: if all of us had slowed down, cared for each other, we would have won by a fair mile.\n\nYou have put on your blindfold. And so have I.\n\nI am not blaming you.\n\nMaybe I am.\n\nBecause you are hurting me—hurting me by trying to become something that might just be an illusion.\n\nI must worry whether you're really finding any happiness.\n\nThe battle for what’s right and wrong, what’s good and bad for us, has made us lose connection. You are so guarded now that the beautiful being inside cannot communicate anymore.\n\nWhat’s left is just talk. Shallow talk. Pretending.\n\nYou are good in what you believe is good for you.\n\nBut I must say—I do not believe in any of that.\n\nI cherish the beauty I see in you and the world.\n\nI must run too.\n\nBut I’ve made a choice: I’ll go together, with whoever I can.\n\nVictories are great. You will find people pretending to celebrate.\n\nAnd maybe you will find the ones who truly will.\n\nBut deep down, the beautiful thing inside—you never asked what this was all for.\n\nWhat was the independence you were seeking?\n\nWas it just a way of convenience, for your body or your mind?\n\nWas it something you tried to achieve, but didn’t feel in the end?\n\nIf you enjoy what you have,\n\nMy only request, my friend,\n\nIs to see if you're all alone in what you achieved.\n\nIt’s not bad to achieve alone.\n\nBut if you can share it—\n\nIt would just be better."
}
