{
  "title": "Am I Born at the Right Time?",
  "author": "Ashok Paudel",
  "content": "Experiencing reality is quite amazing. \"Who am I?\" is often the question that I ask myself, and one of the most fascinating questions to myself is, \"Am I born at the right time?\" When you are a computer engineer and you have ChatGPT to do the code for you, of course. \n\nWell, the AI is taking up your job and you are not ready for it. When you are developing interests in Nanotechnology and your civilization has already figured out how to manipulate atoms, photons, and many other, what they call, God particles. When you feel like you can figure out everything, NO, just kidding, I have not figured out anything at all.\n\nBut the very thought of being alive is fascinating to me. My mind struggling to be alive and get some attention through social media, my body trying to manage all those systems and all, and I watching it carefully, so I think that I am becoming wise by knowing more about how the world around me plays its things, understanding businesses, ways to make money. Oh, another war in the Middle East. No, I was not born at the right time.\n\nWhat holds is uncertainty. Should I be preparing for a war, or should I be preparing how to handle all those media queries when I become a billionaire when the price of DOGE coin hits 100k that I have invested in? What about the life of my grandmother who is still struggling in the kitchen, has not even stepped outside the house more than a dozen times, that too only when she is sick. Oh, wait, my niece is holding an iPhone. I never got to have a mobile phone when I was a teen. Well, I did not need one at that time. I was happily playing, catching frogs and fish in my village.\n\nMy father who struggles to find a job, and here I am in the world’s biggest economy where, if you have a skill and sell it, well, 6 figures on the way to your bank account. My father ploughing our farm and oh, my interest to do the same. I usually do Uber Eats now. What about my mother, who sacrificed her ambitions because she gave birth to me, or her in-laws were not supportive of her? I mean, you are an educated girl, more knowledgeable than a few people in a rural village of a third-world country, and you have ambitions. Well, good luck to you. Here is my sister who is high on her inspirations and tells me that it is her life, and it is she who is responsible for making her life better. Good luck to her too. Yes, I will be supportive of her. Time has changed.\n\nWell, you lose $15 when you sign up for a crypto trading app that promises you once you trade $100 of cryptocurrency, you can win up to 1 BTC (Bitcoin, and you do not need your social security card for that), and you end up losing $20 with a partial BTC worth $5, to be precise, $5.02. (Cryptocurrencies are regulated by, I do not know, some sophisticated technology, so it is up to you to figure out the present, I meant current, price.)\n\nWhat about children at war? Well, I am here in AC watching them fight for the UN food relief program, feeling the world is a cruel place. Why don’t humans feel for others? If I had been in their place, what a beautiful world this would be. Of course, seeing some homeless and judging them is a totally different thing. And yes, the struggle for existence is all about getting a seat on your university shuttle. Beyond that, I do not do it anymore.\n\nThat girl whom my roommate likes, but from inside he feels he can get someone better than her, but the attachments that he created through text messages. Yes, he told me that he did not feel anything when he saw her physically and still pretends to like her. Well, who am I to judge? Like me, he is also struggling, searching for good, better, and the best. Trying what is in his hands; what is beyond is beyond.\n\nHey, I was talking about consciousness. Yes, the consciousness. What if I was born during the 2nd World War, or I was in a Nazi concentration camp? The Search for Meaning would have been my life story. I do not need to think that far. If I get into an accident today and I did not upload this to my database, no one will ever know that I wrote something. Well, I forgot to mention I have auto-saved it in OneDrive, so someone might be able to see it. You should know about databases, machine learning by now when you have hundreds of people on LinkedIn telling you that you do not have to pay for some course. Sometimes you do need to pay for a webinar though, where they will teach you how to tailor your resume for a software engineering job, even if you are a psychology major. Everything computerized, for real.\n\nFocus, am I born at the right time? How would you know when you have not seen the future nor the past? Well, self-automated taxis are around Austin, Texas, and I am sometimes jealous of my future generation. Well, how I feel good about them is that AI will be taking their jobs, they will not have good relationships with each other, at least that’s what is predicted. Oh, if they were experiencing a war, nuke, and all of them will be dead. Well, my parents were lucky that they had a good relationship, at least they pretended to (the truth is different, I have seen with my own eyes). They did not have smartphones though.\n\nI am now getting anxious about all this. Were my past generations happier than me, or will my future generations be happier than me? Well, that’s no good. How can they be happier? I am getting some serious headache. Well, is it possible that my son will not have a headache? I mean, machine learning should be able to figure these things. What do you mean that I am getting more stressful, depressed, and anxious, and my parents were more relaxed? See, I am very happy (let me pretend it for a while and tell no one that I beg you for a hug).\n\nChatGPT helped me check my grammar for this essay. I do not know; I will call it a piece of writing. No, ChatGPT was down today, Gemini did that to me. It also told me that there is no structure in my writing. I guess it was not trained for this before."
}
